Revit 2027 API
RebarCurvesData.GetNumberOfBarGeometry Method
 Gets the number of Bar Geometry that were added.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetNumberOfBarGeometry()
Public Function GetNumberOfBarGeometry As Integer
public:
int GetNumberOfBarGeometry()
member GetNumberOfBarGeometry : unit -> int
Return Value
Int32
 Returns the number of Bar Geometry that were added.
See Also
Reference
RebarCurvesData Class
Autodesk.Revit.DB.Structure Namespace